#문장(statement) : 파이썬이 실행 가능한 코드의 최소 단위 : 엔터 쳐서 정상적으로 실행되면 문장 
#만약 아무것 도 안 적혀 있으면 "Null Statement"라고 함
#표현식 (expression) : 값으로 평가될 수 있는 코드의 최소 단위
#리터럴 (literal) : 소스 코드에서 직접적으로 표현되는 값
#예를 들어 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, "Hello", "Python" 등등
#식별자는 변수, 함수, 클래스, 모듈 또는 다른 객체를 식별하는데 사용되는 이름
#식별자는 대소문자를 구분하고, 밑줄 문자(_)나 문자로 시작해야 하며, 숫자로 시작할 수 없다.    
#연산자 : 특정한 작업을 수행하기 위해 사용하는 기호 (operator)
#예를들어 +, -, *, /, %, //, **, =, ==, !=, >, <, >=, <=, and, or, not, in, is, &, |, ^, ~, >>, << 등등
#이러한 연산자는 값과 연동되어서 특정 작업을 수행하여 의미를 갖기 때문에 단독으로 쓰이지는 않는다.